export const MESSAGES = {
  REGISTER_SUCCESS: {
    en: "User registered successfully",
    hi: "उपयोगकर्ता सफलतापूर्वक पंजीकृत हुआ",
    ta: "பயனர் வெற்றிகரமாக பதிவு செய்யப்பட்டார்",
    pa: "ਯੂਜ਼ਰ ਸਫਲਤਾਪੂਰਵਕ ਰਜਿਸਟਰ ਹੋ ਗਿਆ",
    bn: "ব্যবহারকারী সফলভাবে নিবন্ধিত হয়েছে",
  },
  REGISTER_FAIL: {
    en: "User registration failed",
    hi: "उपयोगकर्ता पंजीकरण विफल रहा",
    ta: "பயனர் பதிவு தோல்வியடைந்தது",
    pa: "ਯੂਜ਼ਰ ਰਜਿਸਟ੍ਰੇਸ਼ਨ ਫੇਲ੍ਹ ਹੋ ਗਿਆ",
    bn: "ব্যবহারকারী নিবন্ধন ব্যর্থ হয়েছে",
  },
  LOGIN_SUCCESS: {
    en: "Login successful",
    hi: "लॉगिन सफल हुआ",
    ta: "உள்நுழைவு வெற்றிகரமாகும்",
    pa: "ਲਾਗਿਨ ਸਫਲ ਹੋਇਆ",
    bn: "লগইন সফল হয়েছে",
  },
  LOGIN_FAIL: {
    en: "Login failed",
    hi: "लॉगिन विफल रहा",
    ta: "உள்நுழைவு தோல்வியடைந்தது",
    pa: "ਲਾਗਿਨ ਫੇਲ੍ਹ ਹੋ ਗਿਆ",
    bn: "লগইন ব্যর্থ হয়েছে",
  },
  FILE_READ_ERROR: {
    en: "File read error",
    pa: "ਫਾਈਲ ਪੜ੍ਹਨ ਵਿੱਚ ਗਲਤੀ", 
    ta: "கோப்பை படிக்கும்போது பிழை", 
    bn: "ফাইল পড়তে সমস্যা হয়েছে", 
  },
};
